## Using Python to Integrate MongoDB Data into an ETL Process
Modern Data Warehousing and Analytics solutions frequently use languages like Python or Scala to extract data from numerous sources, including relational database management systems, NoSQL database systems, real-time streaming endpoints and Data Lakes. These languages can then be used to perform many types of transformation before then loading the data into a variety of destinations including file systems and data warehouses. This data can then be consumed by data scientists or business analysts.

In this lab you will build upon the **Northwind_DW2** dimensional database from Lab 3; however, you will be integrating new data sourced from an instance of MongoDB. The new data will be concerned with new business processes; inventory and purchasing. You will continue to interact with both the source systems (MongoDB and MySQL), and the destination system (the Northwind_DW2 data warehouse) from a remote client running Python (Jupyter Notebooks). 

Just as in Lab 3, you will fetch data into Pandas DataFrames, perform all the necessary transformations in-memory on the client, and then push the newly transformed DataFrame to the RDBMS data warehouse using a Pandas function that will create the table and fill it with data with a single operation.

### Prerequisites:
#### Import the Necessary Libraries

In [1]:
import os
import json
import numpy
import datetime
import pandas as pd

import pymongo
from sqlalchemy import create_engine

#### Declare & Assign Connection Variables for the MongoDB Server, the MySQL Server & Databases with which You'll be Working

In [2]:
mysql_uid = "root"
mysql_pwd = "Passw0rd123"
mysql_host = "ds2002-mysql.mysql.database.azure.com"

atlas_cluster_name = "cluster0.z5pf4tg"
atlas_user_name = "ryp6vw"
atlas_password = "Premier#13!!!"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "sakila"
dst_dbname = "sakila_dw"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://ryp6vw:Premier#13!!!@cluster0.z5pf4tg.mongodb.net

#### Define Functions for Getting Data From and Setting Data Into Databases

In [3]:
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### Populate MongoDB with Source Data
You only need to run this cell once; however, the operation is *idempotent*.  In other words, it can be run multiple times without changing the end result.

In [4]:
client = pymongo.MongoClient(conn_str["atlas"])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"customer" : 'sakila_customer.json',
              "payment" : 'sakila_payment.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

### 1.0. Create and Populate the New Dimension Tables
#### 1.1. Extract Data from the Source MongoDB Collections Into DataFrames

In [5]:
query = {}
collection = "customer"

df_customer = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_customer.head(2)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [6]:
query2 = {}
collection2 = "payment"

df_payment = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection2, query2)
df_payment.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

#### 1.2. Perform Any Necessary Transformations to the DataFrames

In [7]:
drop_cols = ['last_update']
df_customer.drop(drop_cols, axis=1, inplace=True)
df_customer.rename(columns={"customer_id":"customer_key"}, inplace=True)

df_customer.head(2)

,customer_key,store_id,first_name,last_name,email,address_id,active,create_date
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36

In [8]:
drop_cols = ['last_update']
df_payment.drop(drop_cols, axis=1, inplace=True)
df_payment.rename(columns={"payment_id":"payment_key","customer_id":"customer_key"}, inplace=True)

df_payment.head(2)

   payment_key  customer_key  staff_id  rental_id  amount         payment_date
0            1             1         1         76    2.99  2005-05-25 11:30:37
1            2             1         1        573    0.99  2005-05-28 10:35:23

#### 1.3. Load the Transformed DataFrames into the New Data Warehouse by Creating New Tables

Here we will call our **set_dataframe( )** function to create each dimension table. This function expects a number of parameters including the usual connection information (e.g., user_id, password, MySQL server name and database), the *table_name* we need to assign to the table, the *pandas DataFrame* we crafted to define & populate the table, the *name* we need to assign to the *primary_key* column, and finally, the database operation (insert or update).

In [9]:
dataframe = df_customer
table_name = 'dim_customer'
primary_key = 'customer_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [10]:
dataframe = df_payment
table_name = 'dim_payment'
primary_key = 'payment_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

#### 1.4. Validate that the New Dimension Tables were Created.

In [11]:
sql_customer = "SELECT * FROM sakila_dw.dim_customer;"
df_dim_customer = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_customer)
df_dim_customer.head(2)

,customer_key,store_id,first_name,last_name,email,address_id,active,create_date
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36

In [12]:
sql_payment = "SELECT * FROM sakila_dw.dim_payment;"
df_dim_payment = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_payment)
df_dim_payment.head(2)

   payment_key  customer_key  staff_id  rental_id  amount         payment_date
0            1             1         1         76    2.99  2005-05-25 11:30:37
1            2             1         1        573    0.99  2005-05-28 10:35:23

### 2.1. Create and Populate the New Fact Tables
#### 2.2. Extract Data from the Source MongoDB Collections Into DataFrames

In [13]:
df_fact_payment = pd.merge(df_dim_customer, df_dim_payment, on='customer_key', how='inner')
df_fact_payment.insert(0, "step", range(1, df_fact_payment.shape[0]+1))

df_fact_payment.head(5)

,step,customer_key,store_id,first_name,last_name,email,address_id,active,create_date,payment_key,staff_id,rental_id,amount,payment_date
0,1,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,1,1,76,2.99,2005-05-25 11:30:37
1,2,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2,1,573,0.99,2005-05-28 10:35:23
2,3,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,3,1,1185,5.99,2005-06-15 00:54:12
3,4,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,4,2,1422,0.99,2005-06-15 18:02:53
4,5,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,5,2,1476,9.99,2005-06-15 21:08:46

##### 2.2.5. Get the Data from the Date Dimension Table.
First, fetch the Surrogate Primary Key (date_key) and the Business Key (full_date) from the Date Dimension table using the **get_dataframe()** function. Also, be certain to cast the **full_date** column to the **datetime64** data type using the **.astype()** function that is native to Pandas DataFrame columns.

In [14]:
df_fact_payment.create_date = df_fact_payment.create_date.astype('datetime64')
df_fact_payment.payment_date = df_fact_payment.payment_date.astype('datetime64')
df_fact_payment.head(2)

,step,customer_key,store_id,first_name,last_name,email,address_id,active,create_date,payment_key,staff_id,rental_id,amount,payment_date
0,1,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,1,1,76,2.99,2005-05-25 11:30:37
1,2,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2,1,573,0.99,2005-05-28 10:35:23

In [15]:
# Rename Foreign Key Columns
df_fact_payment.rename(columns={"create_date" : "created_date_key",
                               "payment_date" : "paid_date_key",
                               "step" : "fact_payment_key",
                               "store_id" : "store_key",
                               "first_name" : "customer_first_name",
                               "last_name" : "customer_last_name",
                               "email" : "customer_email",
                               "staff_id" : "staff_key",
                               "rental_id" : "rental_key",
                               "amount" : "paid_amount"}, inplace=True)


# Reorder the columns
ordered_columns = ["customer_key",
                  "store_key",
                  "staff_key",
                  "rental_key",
                  "created_date_key",
                  "paid_date_key",
                  "customer_first_name",
                  "customer_last_name",
                  "customer_email",
                  "paid_amount"
                  ]
df_fact_payment = df_fact_payment[ordered_columns]
df_fact_payment.insert(0, "fact_payment_key", range(1, df_fact_payment.shape[0]+1))
df_fact_payment.head(2)

,fact_payment_key,customer_key,store_key,staff_key,rental_key,created_date_key,paid_date_key,customer_first_name,customer_last_name,customer_email,paid_amount
0,1,1,1,1,76,2006-02-14 22:04:36,2005-05-25 11:30:37,MARY,SMITH,MARY.SMITH@sakilacustomer.org,2.99
1,2,1,1,1,573,2006-02-14 22:04:36,2005-05-28 10:35:23,MARY,SMITH,MARY.SMITH@sakilacustomer.org,0.99

In [17]:
dataframe = df_fact_payment
table_name = 'fact_payment'
primary_key = 'fact_payment_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

#### 2.3. Count the number of payments made by each customer email and the total amount of money paid for each email

In [18]:
df_payment_by_email = df_fact_payment.groupby('customer_email')['paid_amount'].agg(['count', 'sum'])
df_payment_by_email.head(5)

KeyError: 'email'

In [ ]:
renamed_df_payment_by_email = df_payment_by_email.rename(columns={'count': 'number_of_payments', 'sum': 'total_amount_paid'})
renamed_df_payment_by_email.head(5)